In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

    
pd.set_option('display.max_columns', None)  # Mostrar todas las columnas
pd.set_option('display.max_rows', None)  # Mostrar todas las filas
pd.set_option('display.max_colwidth', None) # Mostrar el contenido completo de las celdas

In [3]:
pip install Faker

SyntaxError: invalid syntax (2869639503.py, line 1)

In [ ]:
df6 = pd.read_csv("C:/Users/luiso/IRONHACK/w3-project_SQL/data/rental.csv")

df6.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [ ]:
customer = pd.DataFrame(df6['customer_id'])

customer.head()

   customer_id
0          130
1          459
2          408
3          333
4          222

In [ ]:
from faker import Faker
import random



# Crear una lista para almacenar los 1000 nombres aleatorios

fake = Faker()

names = []

for _ in range(1000):
    names.append(fake.name())

# Separar los nombres  y los apellidos en dos listas

first_name = []
last_name = []

for name in names:
    first_name.append(name.split()[0])
    last_name.append(name.split()[1])

# crear una columna con first_name y otra con last_name

customer['first_name'] = first_name
customer['last_name'] = last_name

customer

NameError: name 'customer' is not defined

In [ ]:
# Guardar el dataframe customer en un csv

customer.to_csv('customer.csv', index=False)

#